[
    {
        "name": "WLIVE Dresser for Bedroom with 5 Drawers",
        "sku": "S4KDS74H",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e46"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a254"
        },
        "price": 69.99,
        "discountPrice": 65.99,
        "stock": 7,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "MULTIFUNCTION DRESSER: Match perfectly with other WLIVE storage towers; This chest of drawers is great for bedroom, closet, living room, hallway, dorm and office.\nLARGE STORAGE SPACE: The dresser for bedroom is ideal for organizing your clothes and daily necessities; Wood top can place things you want to display or keep in reach, such as lamp, photos…\nSTURDY STORAGE UNIT: Strong steel frame offers stable support and ensures years of use; Non-woven fabric bins are easy to clean. The dresser can also be used as a TV stand for TV up to 43.\n5 DRAWER CHEST: Features 5 removable foldable drawers; Easy pull handles help open and close the drawers smoothly; 4 adjustable feet protect your floor from scratches.\nEASY ASSEMBLY: This storage drawer unit is easy to assemble with hardware included; Assembly video has been uploaded for guidance. Overall dimensions: 39.4\" L x 11.8\" W x 26.6\" H.",
        "images": [
            "https://m.media-amazon.com/images/I/81oMa50AscL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/81XN7YXw22L._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81VULERRlDL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/91xNPjikZ+L._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/717taGynruL._AC_SX679_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a255"
            },
            {
                "$oid": "664f12f46da3668c1944a256"
            }
        ],
        "createdAt": "2024-05-01T04:12:22.005+00:00",
        "updatedAt": "2024-05-01T04:12:22.005+00:00"
    },
    {
        "name": "Table with Charging Station",
        "sku": "F56DER45",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e4a"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a250"
        },
        "price": 25.99,
        "discountPrice": 24.99,
        "stock": 10,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "🔋【2 x USB Ports & 2 x 3-Prong Outlets】Low Battery Where is the Power Outlet? It’s just within your arm’s reach. The ETL certified charging station of the small side table with storage can charge 4 devices simultaneously. 6.5 ft power supply cord also provides great convenience.\n❤️【Safety Design】The outlets are designed on the left vertical side, safer to use. You don’t have to worry about electric shock caused by spilled drinks. Besides, the small end table living room and bedroom adopts the round corners and the edges are manufactured smooth to prevent injury.\n🍷【Versatile End Table】 The rustic narrow end table comes with a flip top drawer and 2-tier storage shelves offering ample space to storge and display where you can place your decorative lamps, drinks, phone, etc. This small bedside table is great for living room, bedroom and some small spaces.\n🛠️【Easy to Assemble】 With the simple structure and accessories marked with numbers, you can easily assemble the small nightstand with the detailed instruction and tools. You can also assemble this couch table refer to the installation video on the product page. Any quality problem, assemble problem or missing parts please don't hesitate to contact us.\n⭐【Fit in Small Spaces】 This narrow side table with charging station takes up little space due to its compact design which makes it a perfect solution for small spaces and its excellent organize function makes it can also work as a great night stand for your bedroom.\n💪【Quality You Can Trust】 Yoobure slim end table with storage is composed of durable particle board and sturdy steel frame to provide long-lasting durability and sturdiness, supporting up to 100 lbs for table top. And the bearing capacity of each shelf is 20 lbs. 𝐎𝐯𝐞𝐫𝐚𝐥𝐥 𝐃𝐢𝐦𝐞𝐧𝐬𝐢𝐨𝐧𝐬: 𝟐𝟑.𝟔\"𝐋 𝐱 𝟏𝟏.𝟖\"𝐖 𝐱 𝟐𝟑.𝟖\"𝐇",
        "images": [
            "https://m.media-amazon.com/images/I/7164+J-WIyL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/61q7ER5wSuL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/61gkP2E-dtL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71pJkwG2pzL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71TBWI55pnL._AC_SX679_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a255"
            },
            {
                "$oid": "664f12f46da3668c1944a256"
            },
            {
                "$oid": "664f12f46da3668c1944a257"
            }
        ],

        "createdAt": "2024-05-01T10:15:22.005+00:00",
        "updatedAt": "2024-05-01T10:15:22.005+00:00"
    },
    {
        "name": "High Back Mesh Office Chair with Retractable Footrest",
        "sku": "SD345HUO",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e4a"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a255"
        },
        "price": 33.99,
        "discountPrice": 31.99,
        "stock": 20,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "【Innovative Ergonomic Design】VECELO ergonomic mesh office chair features an innovative ergonomic design with biomimetic curves separating chair back. Scientifically divided zones provide support to each part of the spine—neck, back, and waist. The ergonomic office chair lumbar support conforms to the lumbar spine, ensuring a snug fit without suspension. The wide curved headrest armrests of our ergonomic office chair with headrest is 3D adjustable, relieving pressure on neck and elbows.\n【Breathable Mesh Seat】This comfortable office chair seat is built with a breathable mesh cushion with HD dragon-scale mesh that is wear-resistant and non-slip. Our office chair mesh seat and back offers refreshing and breathable experience, with ample elasticity and strong tensile strength. The ergonomic curved surface of the cushion conforms to the leg curve, reducing pressure on the legs. Even during prolonged use, this computer chair ensures a comfortable and breathable sitting.\n【Multi-Functional Desk Chair】This office chair with adjustable arms features adjustable seat height (19.2-22.3 inches), a reclining function that can be locked at any angle between 90°-135°, a hidden retractable footrest for convenient sliding, and fatigue-relieving leg support. With 3D adjustable headrest and armrests, the work chairs for home office provide optimal support for neck and elbows.\n【Stable & Safe Structure】The office chair for heavy people is built with a thickened explosion-proof steel base, reinforced steel four-stage gas lift, passing 120,000 lift tests for safety. The high-load-bearing nylon five-claw base is sturdy and durable, supporting a static load of up to 500lbs. VECELO big and tall office chair soft PU-wrapped silent universal wheels is smooth, non-slip, and floor-friendly.\n【Easy to Assemble】Compared to other mesh chair,or computer chair, VECELO reclining office chair with footrest with fewer components,is seamlessly molded, and less prone to loosening. The assembly process is simplified and comes with all necessary tools and parts. If you have any questions before or after purchase our home office desk chair,feel free to contact us.",
        "images": [
            "https://m.media-amazon.com/images/I/81ylpqEqaBL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/810e-r1ACOL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/714XHcJ4hyL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81jvv-A+h9L._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/91u+cljuElL._AC_SL1500_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a256"
            }
        ],
        "createdAt": "2024-05-02T14:28:47.005+00:00",
        "updatedAt": "2024-05-02T14:28:47.005+00:00"
    },

    {
        "name": "Modern Farmhouse Double Barn Door Accent Cabinet",
        "sku": "JK745JUI",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e4b"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a254"
        },
        "price": 31.99,
        "discountPrice": 28.99,
        "stock": 11,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "2 barndoor cabinets for farmhouse flair with exposed metal accent hinges\nPhoto-ready laminate finish\n2 adjustable interior shelves and 1 drawer with telescoping metal drawer glides\nUse in a living room home office, or entryway\nAssembly is required",
        "images": [
            "https://m.media-amazon.com/images/I/81VCNW0x6ZL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81NF4ukHkZL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81y2o19hb0L._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81FST1Y4IDL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/91TEDHmRHDL._AC_SL1500_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a255"
            }
        ],

        "createdAt": "2024-05-03T09:42:33.005+00:00",
        "updatedAt": "2024-05-03T09:42:33.005+00:00"
    },
    {
        "name": "Bakers Rack with Power Outlet, Microwave Stand, Coffee Bar",
        "sku": "DERT65UH",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e4b"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a254"
        },
        "price": 45.99,
        "discountPrice": 43.99,
        "stock": 13,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "Particleboard, Steel\n[Safe Charging Station] This baker's rack features a power outlet with 4 AC outlets, equipped with overload, leakage protection, and an on/off switch, ensuring safe powering of multiple appliances\n[Adjustable and Flexible] Each of the 2 lower middle shelves offers 3 height adjustments to accommodate items of varying sizes. Additionally, the lower space provides 2 installation options to suit your needs\n[Versatile Storage] This rack is equipped with 8 S-hooks for hanging cups or ladles, 2 top shelves for storing spices or cereal containers, and a pull-out basket for cutlery, maximizing your kitchen's storage potential\n[Sturdy, Stable, Stylish] Made with particleboard and 0.8” steel tubes, this coffee bar ensures robust stability. Adjustable feet and anti-tip kit provide extra safety. Its rustic brown finish complements a variety of decors\n[Easy Assembly] With clear illustrations and numbered parts, assembling this kitchen storage rack is a breeze, allowing you to quickly organize your countertop and enjoy a more spacious kitchen environment",
        "images": [
            "https://m.media-amazon.com/images/I/71VC23E-UQL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/811b2wsrB4L._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71Km-bkFLEL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/81yMmyy16rL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71U0gT-JjaL._AC_SX679_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a256"
            },
            {
                "$oid": "664f12f46da3668c1944a255"
            }
        ],
        "createdAt": "2024-05-04T16:50:18.005+00:00",
        "updatedAt": "2024-05-04T16:50:18.005+00:00"
    },
    {
        "name": "Drawer Mobile File Cabinet",
        "sku": "BE45VGRT",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e46"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a250"
        },
        "price": 55.5,
        "discountPrice": 45.0,
        "stock": 10,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "Office Storage Solution Featuring with 3 fabric drawers, this file cabinet with shelves are designed to keep stationery, files and other home office supplies organized with ease. Proper size makes it a great option to fit under your desk or to have in small offices. \nMultifunctional & Stylish: With a wide wood top and open storage shelves, this office cabinet can also be used as a printer stand, providing plenty of room for extra paper or files, or as a living room storage cabinet.\n Ample Storage: Space Having 2 pencil drawers and 1 file drawer for A4 / letter size hanging file folders, the lateral filing cabinet can store large amounts of paperwork while taking up minimal space, and potentially increase productivity through reduced clutter and easy access.\n Easy to Move: Rolling on 4 wheels, including 2 lockable casters, this mobile file cabinet can fix or move around your home office freely. Unique fabric drawer design makes it only weigh 22 lbs. and light to move.\n Easy Assembly: Sturdy steel frame with wooden shelves and fabric drawer, provide strong support for storage while easy to assemble, spare time from putting together a lot of pieces.",
        "images": [
            "https://m.media-amazon.com/images/I/71Q-zCiXS+L._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/81YFqntkPrL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/81NCKbR9HBL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/91mjhF9d+-L._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/91rYfDPEMGL._AC_SX679_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a255"
            }
        ],
        "createdAt": "2024-05-05T11:55:49.005+00:00",
        "updatedAt": "2024-05-05T11:55:49.005+00:00"
    },
    {
        "name": "Drawer Dresser, Fabric Storage Tower",
        "sku": "DIEFMDHS",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e46"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a255"
        },
        "price": 95.99,
        "discountPrice": 90.99,
        "stock": 5,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "Multifunction Tower: This fabric dresser for bedroom is ideal for wherever you want to keep clutter under control, such as bedrooms, playrooms, entryways; matches perfectly with other WLIVE storage organizers.\n Roomy Storage Space: The 9 foldable deep drawers are so spacious that they provide endless organizational possibilities. Wooden top is great for lamps, clocks, glasses and other daily essentials, keeping them in your reach.\n Sturdy and Durable: Strong steel frame and water-resistant wood top offer stable support and ensure years of use; 4 adjustable plastic feet can protect your floor from scratches and are also designed for uneven ground.\n Safe for Your Family: Feel free to place chest of drawers anywhere; the anti-tipping accessories included can prevent incidents; the non-woven fabric is breathable and harmless, suitable for teens and adults.\nOverall Dimension: The fabric dresser measures 39.6 L x 11.8 W x 40.2 H. The storage tower comes with instructions and all hardware needed for installation, easy to assemble.",
        "images": [
            "https://m.media-amazon.com/images/I/81pHfuh0V3L._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/91bsjbIVXcL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/814fjUXCTKL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71SJZH6M1aL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/815JCmQIJEL._AC_SX679_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a255"
            },
            {
                "$oid": "664f12f46da3668c1944a259"
            }
        ],
        "createdAt": "2024-05-06T08:03:27.005+00:00",
        "updatedAt": "2024-05-06T08:03:27.005+00:00"
    },
    {
        "name": "Coffee Bar, Baker’s Rack for Kitchen",
        "sku": "DU8504FG",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e4b"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a252"
        },
        "price": 16.99,
        "discountPrice": 15.99,
        "stock": 10,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "Particleboard, Steel\n[Storage for All] Free up your counter space with this baker’s rack that boasts tons of storage—3 upper shelves for bottles, 3 large lower shelves for kitchen appliances, and 6 S-hooks for cooking tools. This all-in-one rack streamlines your kitchen!\n[Adjustable Middle Lower Shelf] The middle shelf of the large lower shelves can be adjusted to 2 heights to fit utensils of different heights, from a blender and an air fryer to pots and pans\n[Solid Construction] Combing a robust steel frame with durable particleboard, this kitchen appliance storage rack is strong and solid to hold your microwave, coffee machine, and other accessories\n[Delights Small Spaces] Standing at 15.7\"D x 31.5\"W x 65.7\"H, this 6-tier kitchen shelf is a perfect fit for compact kitchens or works great as a mini coffee bar, letting you make full use of your space\n[Wobble-Free and Secure] The adjustable feet help balance out small irregularities and prevent scratches on the floor; the anti-tip kit included helps you fix this kitchen shelving unit to the wall for greater stability",
        "images": [
            "https://m.media-amazon.com/images/I/5112-m2fOPL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/61aoFtkxEaL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/61CSN91kkbL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71uuAuGZeJL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/716waQXSHUL._AC_SL1500_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a255"
            },
            {
                "$oid": "664f12f46da3668c1944a256"
            }
        ],
        "createdAt": "2024-05-07T13:20:01.005+00:00",
        "updatedAt": "2024-05-07T13:20:01.005+00:00"
    },
    {
        "name": "Furnulem Nightstand with 3 Drawers and 2-Tier Shelf",
        "sku": "PRE64F4D",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e46"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a253"
        },
        "price": 29.99,
        "discountPrice": 26.99,
        "stock": 12,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "【Multi-scene Application】This nightstand is designed in a modern industrial style, which is attractive and functional, making it suitable for any room. It can be a storage dresser in the bedroom or a side table in the living room, also great for closets, nurseries, entryways, hallways, offices, playrooms and more.\n【Double Display Shelf】Specially designed with the double-layer shelf. The wooden top is solid and wear-resistant. It can display vases, photo frames, lamps, decorations, etc. Or it can be used to place glasses, alarm clocks, books, chargers and other sundries, which is not only convenient and practical but also artistic as a decor.【Durable Storage Drawer】Features foldable storage drawers. Each fabric drawer (NOT WOOD) offers large storage space, perfect for organizing clothes, toys, socks, underwear, scarves, blankets and other accessories. The drawers are made of cationic fabric, lightweight and durable, and won't pinch hands, also safe for child to use.\n【Sturdy Structure】The chest of drawer is made with sturdy metal frame, and its back is equiped with more reinforced X-type crossbar, which offers high strength support and ensure years of use. It weighs only 17 pounds, isn’t bulky and easy to move. Anti-toppling device is provided to prevent it from falling down. Fully guaranteed stability and safety.\n【Easy to Assemble】The package includes all the tools and accessories, you can install it in 20 minutes with the instruction. The wood dresser is slim and light, and does not take up much space. Perfect Gift for a housewarming or your family and friends. Overall dimension: 11.5'D x16.1'W x 43.3'H",
        "images": [
            "https://m.media-amazon.com/images/I/719AAUhW71L._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71zMcYPTgXL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/81D76aY8QdL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71u1VAcOkzL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71UmEOZcL2L._AC_SX679_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a255"
            },
            {
                "$oid": "664f12f46da3668c1944a257"
            },
            {
                "$oid": "664f12f46da3668c1944a256"
            }
        ],
        "createdAt": "2024-05-08T10:37:44.005+00:00",
        "updatedAt": "2024-05-08T10:37:44.005+00:00"
    },
    {
        "name": "Double Dresser for Bedroom",
        "sku": "SDP84GTS",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e46"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a252"
        },
        "price": 49.99,
        "discountPrice": 44.99,
        "stock": 9,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "MODERN DESIGN: The 6 drawer dresser for bedroom use combines a sleek modern design with functional storage. The aesthetics of this bedroom dresser bring a stylish touch to any living room or bedroom decor\nVERSATILE STORAGE: This double dresser for bedroom use also serves as an ideal storage cabinet in your living room. It doubles as a TV stand and stores electronics, photos, and more, making it your go-to drawer storage solution\nDURABLE CONSTRUCTION: Built from non-toxic laminated composite woods, this bedroom dresser stands as a sturdy piece of bedroom furniture. With beautifully brushed nickel drawer knobs and smoothly gliding drawers, it's a great addition to any decor\nSIMPLE ASSEMBLY: The dressers for bedroom wood construction ships flat-packed and assembles effortlessly in under 2 hours. This convenient feature makes it an ideal clothes organizer or storage dresser for any bedroom or living room setup\nPERFECT FOR SMALL SPACES: Our double dresser for bedroom measures 17.5\" D x 59\" W x 29\" H, allowing it to fit perfectly against any wall. The drawers for clothes are spacious, each measuring 12.5\" D x 24.75\" W x 5\" H, providing roomy storage for all your necessities.",
        "images": [
            "https://m.media-amazon.com/images/I/61+QEip+BhL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/51nuidvXh5L._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/81KzcBN8PoL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/817gHh8Cq8L._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/31BQH9UZbDL.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a256"
            },
            {
                "$oid": "664f12f46da3668c1944a257"
            },
            {
                "$oid": "664f12f46da3668c1944a255"
            }
        ],
        "createdAt": "2024-05-09T15:45:39.005+00:00",
        "updatedAt": "2024-05-09T15:45:39.005+00:00"
    },
    {
        "name": "YITAHOME Dresser with 6 Drawers",
        "sku": "T4EP07GH",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e46"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a251"
        },
        "price": 22.99,
        "discountPrice": 20.99,
        "stock": 14,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "LARGE CAPACITY- 6 drawers in different sizes provide multiple storage options and ample room to make your living space neat and tidy; Overall dimensions: 31.5\" L x 11.4\" W x 31.1\" H. Drawer dimensions: 21.3\" L x 11.2\" W x 7.5\" H / 7.7\" L x 11.2\" W x 7.5\" H.\nQUALITY CONSTRUCTION- Made from reliable metal frame and durable MDF wooden top; 6 removable and foldable drawers; Easy pull fabric handles help conveniently open and close the drawers; 4 adjustable plastic feet help protect your floor from scratches.\nDURABLE FABRIC - All the outer and inner material is made from premium, breathable non-woven synthetic fabric; Easy maintenance, just wipe clean with a damp cloth and let air dry./nUNIVERSALLY COMPLEMENTARY- Premium black grey fabric drawers, with sturdy black metal frame and wooden tabletop; Enjoy modern scent and stylish aesthetics that easily complements various living spaces: living rooms, bedrooms, hallways, entryways, closets, etc./nEASY TO ASSEMBLE- Detailed instructions and installation video will guide you through a hassle-free installation; All hardware is included in the package so you only need to fasten some screws.",
        "images": [
            "https://m.media-amazon.com/images/I/818HEM9-4LL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/81-akKrTmeL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/81+DIl6L2GL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/819ERMZAxJL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71J1fpcrqNL._AC_SX679_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a256"
            },
            {
                "$oid": "664f12f46da3668c1944a257"
            }
        ],
        "createdAt": "2024-05-10T12:51:17.005+00:00",
        "updatedAt": "2024-05-10T12:51:17.005+00:00"
    },

    {
        "name": "Avenco Queen Size Mattress",
        "sku": "FR439UTS",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e47"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a250"
        },
        "price": 31.99,
        "discountPrice": 29.99,
        "stock": 20,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "【Refreshing and Comfortable Sleep】The Avenco foam mattress 12 inches is designed with a 3-layer foam system for better support and comfort. The bottom foam layer incorporates bamboo charcoal which not only absorbs odors and wicks away sweat.\n【Pressure Relief】The queen foam mattress boasts three layers consisting of top-notch foams, ensuring a sleep experience that combines support and comfort. By employing high-density foam, this mattress effectively embraces your body, facilitating uniform weight dispersion and relieving pressure on vital regions such as the shoulders, hips, and lower back.\n【CertiPUR-US & Oeko-Tex Standard 100 Certified】The Avenco queen size mattress is a product of premium quality, crafted with CertiPUR-US Certified foam and OEKO-TEX certified fabric. The materials used in this mattress are free from any harmful substances, ensuring a safe and healthy sleeping experience.\n【Mattress in a Box-Easy to Move】Our 12-inch queen mattress is conveniently vacuum-compressed, rolled, and shipped in a compact box to ensure easy handling and installation. Due to the compression process, we recommend that you allow the memory foam mattress a period of 48-72 hours to fully expand and regain its original shape. It is important to note that the pace of expansion may be influenced by the ambient temperature within the space.\n【Worry-Free Purchase & 100-night Trial】At Avenco, we understand that everyone has unique sleeping preferences. That's why we offer a 100-Night trial, 10-year warranty, and expert customer service with all of our mattresses. Our goal is to ensure that every customer has an optimal shopping experience and is completely satisfied with their purchase. Please don't hesitate to get in touch with our Customer Support Team if you have any problems or aren't entirely satisfied",
        "images": [
            "https://m.media-amazon.com/images/I/71vRVPOvuAL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/81VWTG4o+rL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/716tXpmdCpL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81+ADPKwp0L._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71r2Rk3oNsL._AC_SL1500_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a257"
            }
        ],
        "createdAt": "2024-05-11T08:06:11.005+00:00",
        "updatedAt": "2024-05-11T08:06:11.005+00:00"
    },

    {
        "name": "Flash Furniture Capri Comfortable Sleep",
        "sku": "LOY53GRF",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e47"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a252"
        },
        "price": 10.99,
        "discountPrice": 9.99,
        "stock": 6,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "12\" KING HYBRID POCKET SPRING MATTRESS: Pairs luxurious comfort with optimal support so you can wake up each morning feeling refreshed and ready to take on the day \nLAYERS OF COMFORT: Enjoying a blissful night of sleep is effortless with the ultra-soft knitted fabric top and premium high-density foam over a pocket spring core that will power your sleep with conforming comfort every night \nENSURES A SAFE SLEEP ENVIRONMENT: CertiPUR-US Certified foam is free from harmful substances, allowing you to rest peacefully and relaxed knowing the quality of your indoor air won't be compromised \nMATTRESS-IN-A-BOX CONVENIENCE: Ships compressed, rolled, and boxed, making it easy to transport and fit neatly into most bedframes; please allow 48 to 72 hours for your mattress to fully expand \nKING SIZE MATTRESS: Measures 75.5\"W x 81\"D x 12\"H and is compatible with trundle beds, platform beds, and adjustable bed frames so you can choose the perfect bed for your needs",
        "images": [
            "https://m.media-amazon.com/images/I/61NYBL1OqmL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71DcxP3TqqL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/61hmT6TOrIL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61BA4zkqQ4L._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/517iIpUjLOL._AC_SL1500_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a256"
            }
        ],
        "createdAt": "2024-05-12T09:29:25.005+00:00",
        "updatedAt": "2024-05-12T09:29:25.005+00:00"
    },

    {
        "name": "Walker Edison 2 Piece Outdoor Patio Chevron Wood Chair",
        "sku": "LPG53954",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e48"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a251"
        },
        "price": 15.99,
        "discountPrice": 13.99,
        "stock": 11,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "Dimensions: 35\" H x 25\" L x 25\" W\n Made with solid acacia wood, perfect for outdoor use\nIncludes 2 chairs. Each chair supports up to 250 lbs.\nResistant to a variety of outdoor elements\nApply teak oil every 2-3 months",
        "images": [
            "https://m.media-amazon.com/images/I/71t8bmfUstL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/910eGWZ1hVL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81wkxO6LE9L._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81r4v32speL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71HRBIRCCCL._AC_SL1500_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a255"
            }
        ],
        "createdAt": "2024-05-13T14:35:53.005+00:00",
        "updatedAt": "2024-05-13T14:35:53.005+00:00"
    },
    {
        "name": "Pamapic 5 Piece Patio Dining Set",
        "sku": "SE4962JH",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e48"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a250"
        },
        "price": 36.99,
        "discountPrice": 33.99,
        "stock": 10,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "【Plastic-Wood Table Top】 The new plastic-wood table top makes the dining table more durable, dirt-resistant and easy to clean. The 1.6-inch hole allows you to add a parasol for shade. And the legs of the table have adjustable legs to ensure the stability of the table.\n【Weather Resistant Materials】 This dining table set has a stable and sturdy iron construction, which can be used for long time. And the premium PE rattan materials can adapt to different weather because it is durable and not easy to crack.\n【Comfotable & Machine Washable】 The rattan chair is equipped with a soft cushion made of Olifan fabric and thick foam to ensure a comfortable seating experience. The cushion can be firmly fixed to the chair and when the cushions need cleaning it can also be detached and machine washed for easy maintenance.\n【Creat Outdoor Comfort Zone】 Including a square dining table and 4 rattan chairs with soft cushions, this outdoor dining set is a relaxing place to have meals or hold a party and can be widely used for patio, deck, backyard, garden, poolside,etc.\n【Easy to Assemble】 Our dining set arrived in 2 boxes, 2 boxes may not arrive at the same time. You may not get all boxes at the same time. You can get started assembling the dining set quickly and easily as soon as all of them arrive. The load capacity of the chair is 275 LBS. Box 1 size：25.98”×22.44”×25.59”, Box 2 size：38.58”×4.33”×39.37",
        "images": [
            "https://m.media-amazon.com/images/I/816KbNUNhjL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/91ghUtXhDlL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/91yLyXhGsLL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81JCeHMRHgL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81bzzqtkuwL._AC_SL1500_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a255"
            }
        ],
        "createdAt": "2024-05-14T11:42:37.005+00:00",
        "updatedAt": "2024-05-14T11:42:37.005+00:00"
    },

    {
        "name": "Outdoor Chaise Lounge Chairs",
        "sku": "TY96GK45",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e48"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a253"
        },
        "price": 14.99,
        "discountPrice": 13.99,
        "stock": 9,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "Easy Assembly: The outdoor lounge chairs can be effortlessly assembled in 5 minutes without any tools; Simply insert the legs into the middle of the two seat components for connection and stability, then attach the backrest piece to ensure a secure and firm top attachment\nAdjustable Backrest: The pool lounge chair is designed with 4 adjustable positions, including being placed flat; Whether you're sunbathing, reading, conversing, or simply lounging under the sun, adjust the backrest to the most comfortable position\nDurable Material: The outdoor lounge chairs set of 2 is made from high-quality PE resin that provides excellent resistance against UV rays, aging, and fading; Compared to wood and metal, it offers superior all-weather protection with long-lasting durability\nVersatile Use: With its sleek design, the patio lounge chair seamlessly blends into various outdoor settings such as poolside areas, lawns, and balconies; Its lightweight material allows it to be easily moved or carried around for camping trips or beach outings\nEnhance Your Leisure: The lounge chairs for poolside are lightweight to facilitate easy mobility; You can relax by placing it next to the pool for sunbathing or place it on your patio or deck for reading or taking a nap",
        "images": [
            "https://m.media-amazon.com/images/I/51MjoGFPOcL.jpg",
            "https://m.media-amazon.com/images/I/91m0e5kUsdL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/911q2pNsIQL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71ZdDbYOAsL._SL1500_.jpg",
            "https://m.media-amazon.com/images/I/819-7qaDQxL._SL1500_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a257"
            },
            {
                "$oid": "664f12f46da3668c1944a256"
            }
        ],
        "createdAt": "2024-05-15T16:50:09.005+00:00",
        "updatedAt": "2024-05-15T16:50:09.005+00:00"
    },

    {
        "name": "Sectional, L Shape Modular Storage Ottoman",
        "sku": "SGLO845H",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e49"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a252"
        },
        "price": 49.99,
        "discountPrice": 45.99,
        "stock": 9,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "【Modern L-Shaped Modular Couch】The simple design is easy to blend in any modern style decor and can add something to your home or working area. The color is so modern for anyone looking for an updated look. This Linen couch is suitable for many small spaces, such as guest rooms, living rooms, small apartment, etc.\n【Sofas & Couches for Living Room】This 3-piece sofa-and-chaise sectional has an L-shaped silhouette and seats four people for the big game or movie night. It also includes two toss pillows along with a matching ottoman that has interior storage space for blankets and more\n【Sectional Sofa Couch with 2 Cup Holders】Each piece features a solid and manufactured wood frame that rests on low-profile dowel legs. Wrapped in sleek, neutral-toned Linen, this set's cushions are filled with foam and have eight-way hand-tied springs to limit sagging over time. Rounded arms, subtle tufting, and nailhead trim complete this traditional design, One of the middle seats pulls down to reveal two cup holders for your favorite beverages.\n【High Quality Small Sectionals sofa】This masterfully crafted sofa couch tantalizes, high quality Linen seat offers the modular sofa soft and smooth touch and elegant feeling, it is wear-resistant and water-proof. Upholstered with high elastic sponge so that the L shaped sofa full full elastic, fluffy fear of collapse, can effectively relieve the pressure on your hip.\n【Easy to Install】Just install the l shaped couch with accompanying connectors in minutes. We will also provide you with a tool and an explanatory note clearly indicating the identification number of the accessories. Note: This living room sofa set comes in 3 packages in total, shipped separately and may arrive at different days",
        "images": [
            "https://m.media-amazon.com/images/I/71pxf1zehXL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/91+KFbFO4ML._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61otCoFpRHL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/91LNvbA-uiL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71pxf1zehXL._AC_SL1500_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a256"
            }
        ],
        "createdAt": "2024-05-16T12:05:19.005+00:00",
        "updatedAt": "2024-05-16T12:05:19.005+00:00"
    },
    {
        "name": "Futon Sofa Bed, Faux Leather Sofa Couch",
        "sku": "DR863LOP",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e49"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a251"
        },
        "price": 40.99,
        "discountPrice": 38.99,
        "stock": 12,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "【Convertible Sofa Bed Couch】The backrest of the futon sofa bed is 3-position adjustment and the armrest is 4-position adjustment. By adjusting the angle of the backrests and armrests, the futon sofa can be easily converted from sofa to bed. Customize your backrest and armrest positions for personalized comfort.\n【Sturdy & Durable Futon Couch】: Our futon sofa features a sturdy construction with hight quality wood frame and six chrome-plated metal legs that provide excellent support and stability. Moderate sofa height, suitable for both adults and children. With a weight capacity of up to 600 lbs,futon couch bed can handle daily use.\n【Memory Foam Futon Sofa Bed】: Our futon sleeper couch is filled with 3\" memory foam and supportive cotton padding, which is soft and non-collapsing. Moderate thickness can distribute pressure and won’t be too hot in summer. The simple and modern color makes the 70 inch futon blend perfectly with your living room.\n【Perfect for Compact Living Spaces】: Use as a sofa: 71in (L) X 33in (W) X 31.5in (H). Convert to a bed: 71in (L) X 42in (W) X 16in (H). Our convertible sofa bed takes up less space and fits perfectly in compact living spaces, apartments, dormitories, guest rooms, offices, game rooms and living rooms.\n【Easy assembly】: Setting up this futon couch bed is a breeze with clear instructions provided, no professional required. Spend less time on installation, and more time to enjoy the ultimate comfort and functionality. Note: All accessories are in the zippered pocket on the bottom of the loveseat sofa.",
        "images": [
            "https://m.media-amazon.com/images/I/71CmIYY4Y5L._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81+ZQIc5YiL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71jQa62YpfL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71M303l9dlL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71VgFMaVJQL._AC_SL1500_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a255"
            },
            {
                "$oid": "664f12f46da3668c1944a256"
            }
        ],
        "createdAt": "2024-05-17T09:11:41.005+00:00",
        "updatedAt": "2024-05-17T09:11:41.005+00:00"
    },
    {
        "name": "Sectional Comfy Cloud Living Room",
        "sku": "LHFS43RK",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e49"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a250"
        },
        "price": 63.99,
        "discountPrice": 59.99,
        "stock": 15,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "【Elegant And Stylish Sectional Sofa】This modern sectional sofa has a classic design that will never go out of style. The upholstery and sleek lines blend perfectly to create a harmonious appearance that can suit any decor style and enhance your space.\n【Comfy Cloud Couch】Upholstered in polyester blend fabric with cushions featuring thick foam cushion padding for prime relaxation. Lean back and stretch out your legs out long on the chaise lounge when you or guests need more space. The extra-wide and extra-deep seating makes it perfect for entertaining or relaxing with loved ones.\n【Quality And Durability】Manufactured with high-quality wood with spring reinforced cushions, the sturdy frame provides the utmost seating support. The humanization design of the waist pillows provide you enough support when you sit on the sofa for a long time.\n【Overall product dimensions】32.7'' H x 110.6''W x68.9''D, This sectional couch set is compact enough to be able to fit into your apartment, loft, and more while offering ample seating space.\n【Easy Assembly】The sleeper sofa comes with clear instructions and all the tools to help you assemble it easily and quickly. Enjoy the fun of assembly with your partner!",
        "images": [
            "https://m.media-amazon.com/images/I/81Y6h3O6agL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81sqofo3y5L._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71SZefJFlLL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/91IwFbNLJiL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/91aSWqnnLoL._AC_SX679_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a257"
            }
        ],
        "createdAt": "2024-05-18T14:28:33.005+00:00",
        "updatedAt": "2024-05-18T14:28:33.005+00:00"
    },
    {
        "name": "Greesum 3 Pieces Patio Furniture Set",
        "sku": "FU53GTLO",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e48"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a255"
        },
        "price": 32.99,
        "discountPrice": 28.99,
        "stock": 5,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "Sturdy & Durable: The entire furniture frame is made of strong steel, you don’t have to worry about its sturdiness. The steel surface is sprayed with durable paint, which not only makes the furniture anti-rust and anti-corrosion, but also makes the frame lines delicate and smooth.\nBreathable & Comfortable: The seat surface is made of Textilene material, which has the advantages of high tensile strength, water resistance and UV resistance, and is much more breathable and comfortable than rattan seats.\nTempered Glass Table: The table is made of new tempered glass, which is vandal-resistant and heat-resistant. It can be used to hold decorative items such as small flower pots, or to hold a mobile phone, fruit plate or wine glass when you are reading or chatting with friends.\nWidely Used: This patio furniture are suitable for any environment such as poolside, garden, yard, porch or balcony, etc. Since the materials are light, you can easily move them as you like.\nEasy Assembly: A detailed installation and a complete kit will help you assemble the chair without any difficulty. You can quickly complete the assembly by yourself, and the whole assembly process will not take up a lot of your time.",
        "images": [
            "https://m.media-amazon.com/images/I/81g-aOeiwpL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/91p8PsUD8QL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61TmM9gmfZL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/617guQ9lQpL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81GEU4ww5RL._AC_SL1500_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a256"
            }
        ],
        "createdAt": "2024-05-19T11:34:02.005+00:00",
        "updatedAt": "2024-05-19T11:34:02.005+00:00"
    },
    {
        "name": "Novilla Queen Size Mattress",
        "sku": "LURF73GJ",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e47"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a255"
        },
        "price": 18.99,
        "discountPrice": 17.99,
        "stock": 10,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "COMFORT STARTS WITH A COOLER NIGHT SLEEP: The Novilla Queen mattress is constructed with a breathable combination. The outside of bed cover is infused with bamboo charcoal fiber to help dissipate excess heat emitted by your body. The interior uses gel memory foam and egg foam to enhance airflow within the memory foam mattress, ensuring you stay comfortably cool all night.\nPAIN RELIEF & WAKING UP REFRESHED: The 4-layer foam design of the mattress helps relieve pain and improve sleep quality. As you lie on the queen memory foam mattress, the gel-infused foam layer contours to your body, providing relief around pressure points such as hips and shoulders. Simultaneously, the comfort layer enhances foam mattress's bounce, preventing sinking while you sleep.\nSUPPORTIVE & MOTION ISOLATION: The queen size mattress offers solid support in every position. Even if you sleep on the edge of the bed, it will not slip. The high-density foam provides proper spinal alignment and effectively absorbs motion, making it an excellent fit for couples or anyone who is easily disturbed by movement on the queen foam mattress.\nQUEEN MATTRESS IN A BOX: The 12 inch mattress is compressed and delivered in a box, allowing for convenient delivery wherever you need it. It is recommended to wait for at least 72 hours to allow the mattress to fully expand to its original size. The memory foam used in the mattress is CertiPUR-US certified and odor-free, ensuring a healthy sleeping environment for you to enjoy.\nRELIABLE CUSTOMER CARE TEAM: Our goal is to provide you with professional and reliable after-sales service. We offer a 10-year warranty policy and a 100-day free trial sleep period for the queen mattress you purchase. If you are not satisfied, please feel free to provide us with feedback, and we will respond to you promptly upon receiving the information.",
        "images": [
            "https://m.media-amazon.com/images/I/817jXj8gqRL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/81Yron-WtaL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/81YKBjclL-L._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71q0FNS0lgL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/810n+csIi2L._AC_SX679_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a257"
            },
            {
                "$oid": "664f12f46da3668c1944a258"
            }
        ],
        "createdAt": "2024-05-20T16:41:57.005+00:00",
        "updatedAt": "2024-05-20T16:41:57.005+00:00"
    },
    {
        "name": "NeuType Futon Mattress Thicken Sleeping Mattress",
        "sku": "SR69FTUL",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e47"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a254"
        },
        "price": 17.99,
        "discountPrice": 15.99,
        "stock": 10,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "【COMFORT GUARANTEED】With a rich 3-layer core design: Polyester Padding + High-Density Support Foam + Polyester Padding.Our thicken mattresses can provide you with absolute comfort and offer good support for your body which will improve most of the back pain and stiffness caused by sleep. The cover is made of microfiber, which does not generate static electricity.Please feel free to use.\n【FLOOR MATTRESS】Twin Size:80\"L x 39\"W x 4\"Th. Available in 3 regular sizes for your choice.As a moveable rest tool our futon mattresses will always provide you with the right amount of softness, allow you to quickly fall into your dreams and enjoy a golden sleep time.\n【SPACE-SAVING & EASY CLEANING】Comes with Futon Mattress x 1, Zippered Mattress Cover x 1, Bandage x 2, Storage Bag x 1. With High quality zipper design the cover can be easily taken off and washed in the washing machine for easy care,no more cleaning trouble.Worry-free storage with bandages, making it more convenient to carry when traveling.\n【MULTIFUNCTIONAL MATTRESS】 It can be used as Sleeping Floor Mattress in the bedroom,Yoga Mat in the living room,Guest Floor Bed when having a home party.You can also bring it in your car, the mattress is a perfect choice for road trip.\n【IMPORTANT NOTICE】Our product is vacuum packed for convenient delivery. Before first use,Please take out the mattress to get air for at least 72 hours until become its fluffy state,and dry it in the sun will speed up the recovery.",
        "images": [
            "https://m.media-amazon.com/images/I/71fjx7NoNLL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71ZMPl98DJL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71w0tyVmRwL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71+MgdMfdRL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/81Ut0dLy6GL._AC_SX679_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a256"
            },
            {
                "$oid": "664f12f46da3668c1944a257"
            }
        ],
        "createdAt": "2024-05-21T13:49:41.005+00:00",
        "updatedAt": "2024-05-21T13:49:41.005+00:00"
    },
    {
        "name": "Sweetnight Portable Tri Folding Mattress Foldable",
        "sku": "FT84HJLO",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e47"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a253"
        },
        "price": 22.99,
        "discountPrice": 15.99,
        "stock": 6,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "【Star Cover Design】The Sweetnight folding mattress features a unique starry night design that brings you a sense of peace and relaxation with breathable fabric. The top layer is made of high-density foam, providing ample support and instant responsiveness. The bottom layer is made of bamboo charcoal foam, which features moisture and odor adsorption capability for a restful night's sleep.\n【Multi-Purpose Tri-Folding Mettress】The Sweetnight Star Tri-fold Foam Mattress is designed to meet your various needs, whether it's for a seat cushion, a sofa, a recliner, or a bed. With its portable design, you can easily switch between different furniture pieces to accommodate unexpected guests, providing them with a comfy and peaceful night's sleep. It offers practicality and space-saving benefits, allowing you to rest peacefully wherever you go.\n【Portable & Removable Design】The foldable mattress Queen size comes with a removable and washable cover. Its outer fabric cover can be easily removed for washing, either by hand or machine. With the non-slip material on the bottom ensures that it stays securely in place. Its portable design allows for easy storage in a compact shape, making it ideal for those who are short on space.",
        "images": [
            "https://m.media-amazon.com/images/I/812c3p4XGML._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/817QD3KDxCL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71kTmfI7SvL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71fxVPO9NhL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71Mnbt+vzvL._AC_SX679_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a256"
            }
        ],
        "createdAt": "2024-05-22T08:55:12.005+00:00",
        "updatedAt": "2024-05-22T08:55:12.005+00:00"
    },
    {
        "name": "Goplus 4-Piece Rattan Patio Set",
        "sku": "SQUT54VF",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e48"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a254"
        },
        "price": 17.99,
        "discountPrice": 15.99,
        "stock": 10,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "Spacious rattan sofa and chairs with soft cushions provide comfortable seating for 3-4 people.\nDurable construction from weather resistant PE rattan wicker and rust-free steel frame.\nGlass-top coffee table with suction cups offers space for snacks and drinks.\nLightweight design allows easy movement for use in patio, porch, yard, or poolside.\nZippered seat covers are removable for easy cleaning",
        "images": [
            "https://m.media-amazon.com/images/I/61izbXS5ctL._AC_SL1200_.jpg",
            "https://m.media-amazon.com/images/I/81gv13CfwwL._AC_SL1200_.jpg",
            "https://m.media-amazon.com/images/I/71oQVRp70yL._AC_SL1200_.jpg",
            "https://m.media-amazon.com/images/I/615vBfrsXWL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/81XpW7HpLyL._AC_SX679_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a256"
            },
            {
                "$oid": "664f12f46da3668c1944a255"
            }
        ],
        "createdAt": "2024-05-23T14:03:09.005+00:00",
        "updatedAt": "2024-05-23T14:03:09.005+00:00"
    },
    {
        "name": "Shintenchi 47 Inch Black Wood Loveseat Sofa",
        "sku": "LTFS3479",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e49"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a255"
        },
        "price": 45.99,
        "discountPrice": 44.99,
        "stock": 10,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "Great seating: The 47“ loveseat is crafted from strong wood and features a high-density spongy cushion finish. Also the high-density sponge cushion is soft and comfortable, providing ultimate seating comfort and cushion durability to last!\nCharming Sofa: We love the tiny sofa's mid-century modern design. Also we provide 5 popular chic colors for you to choose. This mini couch is colorful and versatile enough to be placed in anywhere you need:bedroom,living room,studio, apartment,cafe etc\nSmall Space Solution:Don’t doubt that our small sofa is definitely a small space solution. Light weight design but durable enough for daily using.This small couch with upholstered sponge,human design, 2 pillows, offer you comfy touch. This sofa is a pretty addition to small space.\nQuick installation:Tool-free assembly,this tiny couch is pretty easy to put together. Just have to connect the parts and screw the legs on, can be installed in less than 20 minutes.Came in one box, included: 2-seat small sofa with 2 same color pillows.\nTips: Since this is a small loveseat, please confirm the size meets your needs before ordering. Dimensions: 47.2\" W x 25.6\" D x 30.3\" H, Seat Height 17.7\", Seat Depth: 21.3\", Weight capacity: 350 lbs,Simple assembly required.",
        "images": [
            "https://m.media-amazon.com/images/I/81wDagS14NL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81-cCB9QSdL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/81AuaIWhGsL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/81ucXfGEBWL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/81eaMAio79L._AC_SX679_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a259"
            },
            {
                "$oid": "664f12f46da3668c1944a256"
            },
            {
                "$oid": "664f12f46da3668c1944a255"
            }
        ],
        "createdAt": "2024-05-24T11:08:53.005+00:00",
        "updatedAt": "2024-05-24T11:08:53.005+00:00"
    },
    {
        "name": "Living Room Piece Sets, Modern Upholstered Couch Furniture",
        "sku": "ST34THLO",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e49"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a254"
        },
        "price": 68.99,
        "discountPrice": 62.99,
        "stock": 10,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "💟💟STURDY STRUCTURE: The frame of the couch is made of high-quality solid wood and metal, which ensures that every part of the sofa is firm and durable. And the sofa has 6 legs, which can bear the weight of sofa evenly. Weight capacity more than 800lbs.\n 💟💟UNIQUE DESIGN:The upholstery mashup of imitation leather and fabric,plus saddle shape armrest make the whole sofa looks unique.\n💟💟EXCELLENT SUPPORT:The seat cushion is made of wood plate,elastic band and high density elastic foam,so that it’s strong enough and comfortable as well.\n💟💟HIGH QUALITY MATERIAL:It’s 100% polyester for the sofa upholstery,high density and elastic sponge so that the sofa is not too soft or too hard. Solid wood sofa legs.\n💟💟Our products are sent in 4 packages, which may be delivered successively. If you have problems with receiving goods, you can contact Amazon's logistics team at any time, and we will reply and solve your problems as soon as possible. Thank you. ",
        "images": [
            "https://m.media-amazon.com/images/I/91mIuFEfRsL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71qSLdp+j8L._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/91nNbfW+zoL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71jA2aJpDYL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61ydInvVJwL._AC_SL1500_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a257"
            }
        ],
        "createdAt": "2024-05-25T16:16:25.005+00:00",
        "updatedAt": "2024-05-25T16:16:25.005+00:00"
    },

    {
        "name": "WLIVE Wood Lift Top Coffee Table",
        "sku": "KIY534FS",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e4a"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a253"
        },
        "price": 24.99,
        "discountPrice": 22.99,
        "stock": 10,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "【Lift Top Design】When sitting on your sofa, the height of other center table may not be enough. This lift top coffee table has an extending top that lifts up to provide a floating raised work. surface,So you can working,dining and storage living room items here.\n【Stable Lift Workbench】High quality lift top mechanism enables the tabletop to be lifted up or lowered down effortlessly and noiselessly, Children don't have to worry about hurting their fingers when using.\n【Plenty of Storage Space】Large hidden compartment beneath the tabletop is enough to store your often-used items like laptop, chess, and remote controllers, keeping them away from dirt.\n【Removable Shelf】 The side drawer equipped with the removable shelf offers extra space for magazines, CDs, and game controllers.\n【Modern Design】The wood grain table top creates the natural beauty of a rustic coffee table，Mid-century design makes the coffee table more modern,perfectly matches your room style and décor.",
        "images": [
            "https://m.media-amazon.com/images/I/81xhCy8yQ6L._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71gay6A64wL._AC_SL1200_.jpg",
            "https://m.media-amazon.com/images/I/71sLyBFx17L._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/917NRzQrn4L._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/91oUqhQ6dbL._AC_SL1500_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a255"
            },
            {
                "$oid": "664f12f46da3668c1944a256"
            }
        ],
        "createdAt": "2024-05-26T12:21:36.005+00:00",
        "updatedAt": "2024-05-26T12:21:36.005+00:00"
    },
    {
        "name": "Small Round Side End Table, Modern Nightstand",
        "sku": "DE45U67D",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e4a"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a252"
        },
        "price": 18.99,
        "discountPrice": 16.99,
        "stock": 10,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "[Quick and Easy to Assemble] Thanks to the simple structure and clear instructions, this side table can be assembled in 5-10 minutes\n[Delights Small Spaces] The 17.7\"Dia. x 19.7\" H end table with 15.6\"Dia. x 7.2\"H basket fits perfectly in small spaces, occupying little space while offering ample storage. You can use it as a side table in the living room or a nightstand in the bedroom\n[Sturdy and Stable] The sturdy particleboard tabletop is fixed to the frame without wobbling. The one-piece U-shaped steel legs offer solid support. The adjustable feet increase the stability and don't scratch the floor\n[Quality Fabric Basket] The double-layered polyester fabric basket is visually appealing, crease-free, and free of chemicals, making it safe to use. Its linen-like appearance adds a touch of uniqueness to this round table\n[Modern and Simple] This simple laurel green round coffee table with a cream white basket will add an extra touch of style to your living room or bedroom and is easy to match with a variety of furniture styles",
        "images": [
            "https://m.media-amazon.com/images/I/71PfQeVSYKL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/51sd9kYtlbL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71uKGbp8K0L._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71DgEhKTOGL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/61I-QPnUbGL._AC_SX679_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a257"
            },
            {
                "$oid": "664f12f46da3668c1944a256"
            },
            {
                "$oid": "664f12f46da3668c1944a259"
            },
            {
                "$oid": "664f12f46da3668c1944a258"
            }
        ],
        "createdAt": "2024-05-27T09:29:18.005+00:00",
        "updatedAt": "2024-05-27T09:29:18.005+00:00"
    },
    {
        "name": "TV Stand for 55 60 inch TV",
        "sku": "ST423965",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e4a"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a251"
        },
        "price": 37.99,
        "discountPrice": 36.99,
        "stock": 10,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "【Wooden Board Stand】This TV stand is capable of accommodating TVs up to 55 and 60 inches, with dimensions of 53.54\"W x 15.75\"D x 18.9\"H and max weight capacity of 150lb. Its mid-century style and make it an ideal entertainment center for your family, as well as a beautiful decorative piece for your living room, bedroom, home office, or lounge.\n【Soft Hinge & Cable Hole】The soft hinges and EASY-PULL handles ensure quiet and smooth closing of cabinet doors of this TV console, and the hinges are both ADJUSTABLE to make sure a secure closure. Each cabinet is equipped with a cable hole at the back, allowing you to place a game console, router, or other devices while keeping their cables organized and out of sight.\n【Adjustable Shelf & Feet】The shelf of this media console is designed to be adjustable, offering 3 different levels to accommodate items of varying heights. This feature allows you to customize the shelf space to suit your needs. Additionally, the center leg at the bottom of the TV stand is also adjustable, ensuring stability on uneven floors.\n【Solid & Durable】This TV table is designed to be stable and sturdy, with 5 legs providing strong support while allowing ample space at the bottom for cleaning. Each leg is equipped with foot pads to protect your floor from scratches. Constructed from high-quality engineered board, this entertainment center will remain solid and durable for many years to come.\n【Easy Assembly】Each part of TV stand is numbered and the package comes with a detailed installation manual, a complete set of installation tools, and there is also an installation video on this page to guide you. If you encounter any issues during assembly, our team is here to provide assistance at any time.",
        "images": [
            "https://m.media-amazon.com/images/I/71sCtjsTm3L._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71GiOg5tBnL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71ZytwdlcTL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71IpeQd4BjL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71d56nHIBQL._AC_SL1500_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a255"
            },
            {
                "$oid": "664f12f46da3668c1944a256"
            }
        ],
        "createdAt": "2024-05-28T08:06:11.005+00:00",
        "updatedAt": "2024-05-28T08:06:11.005+00:00"
    },

    {
        "name": "Buffet Cabinet with Storage",
        "sku": "ER5348GH",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e4b"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a250"
        },
        "price": 56.99,
        "discountPrice": 54.99,
        "stock": 10,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "Sturdy and Stable: This storage cabinet is made of high-quality engineered wood. Fine workmanship, solid base and anti-tipping kit ensure the stability and durability of the coffee bar cabinet. The white finish is smooth, delicate and easy to clean, guaranteed touch and appearance, a microwave cabinet that combines beauty and function, very suitable as a good helper in your kitchen and dining room\nInspired Ingenious Space: The special space layout gives this white storage cabinet a unique advantage, the door with 3-tier adjustable height shelves can accommodate bottles of different sizes, and at the same time there are 3 compartments behind the door, which play an important role of organization, making it a multifunctional kitchen pantry for all your needs\nMultifunctional Sideboard Buffet: With its sleek, simple look and great storage features, this kitchen accent cabinet with microwave stand is a must-have multifunctional piece of furniture for any home. You can use it as a coffee bar cabinet, or flexibly as a console table, bar cabinet, kitchen cabinet, etc.\nDiversified Storage Functions: 3-tier pantry door shelf for canned spices, 1 open compartment for microwave oven, 2 small drawers for knives and forks, paper towels and kitchen utensils, and 4 closed storage compartments provide ample storage space for your food, baking ingredients, wine glasses, etc.\nEasy Assembly: Details in the manual, markings on the components, and pre-drilled holes make installation easy, allowing you to quickly install this kitchen sideboard at home before the party",
        "images": [
            "https://m.media-amazon.com/images/I/71TVN3+tGXL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71m0BWxj6ML._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/61dxzwh9mNL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71fTo+-NS1L._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71hUa6WOonL._AC_SL1500_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a257"
            }
        ],
        "createdAt": "2024-05-29T08:06:11.005+00:00",
        "updatedAt": "2024-05-29T08:06:11.005+00:00"
    },
    {
        "name": "3-Tier Kitchen Baker's Rack",
        "sku": "RT73902F",
        "categoryId": {
            "$oid": "664f11d46da3668c19436e4b"
        },
        "brandId": {
            "$oid": "664f12f46da3668c1944a251"
        },
        "price": 49.99,
        "discountPrice": 46.99,
        "stock": 10,
        "note": "Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.",
        "description": "【24-Hour Immediate reply】:If there are any problems about the microwave cart, please contact us directly, we will reply and offer a solution in 24 hours.\n【Durable & Stable】: Made of thickened laminated wood panel with high glossy finish, waterproof, anti-scratch and easy to clean.Heavy duty powder-coated metal materials, which ensures stability and durability.X frame design adds more stability and durability of the kitchen cart.\n【Dimensions】: L*W*H=35.4 *15.7*32.7 Inch.(L*W*H=90*40*83CM). There may be 1 inch difference in measurement since it is hand measured. Hope you do not mind it.There may be a little color difference due to different monitor settings. Thank you for your understanding.\n【Ample Storage Space】: 1.Extra basket can store fruits and vegetables or some small kitchen necessities. 2.Five little hooks make it easier to hang cooking tools like pots, pans, utensils and etc.\n【Multi-Function】: Perfect as a kitchen baker's rack, microwave oven stand, kitchen storage shelf, spice rack organizer, baker's rack, microwave stand, kitchen workstation shelf, coffee bar station, office storage rack. Fitting in home & kitchen",
        "images": [
            "https://m.media-amazon.com/images/I/71LniEx+O7S._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71RADEtXqVL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/61JynbrZQIL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/61Zb7Df3DbL._AC_SL1500_.jpg",
            "https://m.media-amazon.com/images/I/71mVZcZ2B2L._AC_SL1500_.jpg"
        ],
        "sizes": null,
        "colors": [
            {
                "$oid": "664f12f46da3668c1944a255"
            },
            {
                "$oid": "664f12f46da3668c1944a257"
            }
        ],
        "createdAt": "2024-05-30T08:06:11.005+00:00",
        "updatedAt": "2024-05-30T08:06:11.005+00:00"
    }
]
